In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [37]:
df= pd.read_csv('sample_data.csv',index_col=0)

In [38]:
df

                                   Title   Salary Qualification
Serial Number
1                      Software Engineer  20000.0     Bachelors
2                         Data Scientist  23000.0       Masters
3                        Project Manager  18000.0       Masters
4                              Professor  25000.0     Bachelors
5                     Database Architect  17000.0     Bachelors
6              Machine Learning Engineer  19000.0       Masters
7                       Business Analyst  18000.0           NaN
8                        UX/UI Developer     23.0     Bachelors
9                        Devops Engineer      NaN       Masters

In [16]:
df.shape

(9, 3)

In [17]:
df.isnull().sum()

Title            0
Salary           1
Qualification    1
dtype: int64

In [30]:
df['Salary']= df['Salary'].fillna(df['Salary'].median())

In [31]:
df

                                   Title   Salary Qualification
Serial Number
1                      Software Engineer  20000.0     Bachelors
2                         Data Scientist  23000.0       Masters
3                        Project Manager  18000.0       Masters
4                              Professor  25000.0     Bachelors
5                     Database Architect  17000.0     Bachelors
6              Machine Learning Engineer  19000.0       Masters
7                       Business Analyst  18000.0           NaN
8                        UX/UI Developer     23.0     Bachelors
9                        Devops Engineer  18500.0       Masters

In [32]:
df['Salary'].median()

18500.0

In [33]:
df['Qualification'].mode()

0    Bachelors
1      Masters
Name: Qualification, dtype: object

In [39]:
df['Qualification']= df['Qualification'].fillna(df['Qualification'].mode()[1])

In [40]:
df

                                   Title   Salary Qualification
Serial Number
1                      Software Engineer  20000.0     Bachelors
2                         Data Scientist  23000.0       Masters
3                        Project Manager  18000.0       Masters
4                              Professor  25000.0     Bachelors
5                     Database Architect  17000.0     Bachelors
6              Machine Learning Engineer  19000.0       Masters
7                       Business Analyst  18000.0       Masters
8                        UX/UI Developer     23.0     Bachelors
9                        Devops Engineer      NaN       Masters